PinguinoIDE/pinguino-compilers/windows64/p8/share/gputils/header/p16lf18876.inc
;-----Bank8------------------
SCANLADRL        EQU  H'040C'
SCANLADRH        EQU  H'040D'
SCANHADRL        EQU  H'040E'
SCANHADRH        EQU  H'040F'
SCANCON0         EQU  H'0410'
SCANTRIG         EQU  H'0411'
CRCDATA          EQU  H'0416'
CRCDATL          EQU  H'0416'
CRCDATH          EQU  H'0417'
CRCACC           EQU  H'0418'
CRCACCL          EQU  H'0418'
CRCACCH          EQU  H'0419'
CRCSHFT          EQU  H'041A'
CRCSHIFTL        EQU  H'041A'
CRCSHIFTH        EQU  H'041B'
CRCXOR           EQU  H'041C'
CRCXORL          EQU  H'041C'
CRCXORH          EQU  H'041D'
CRCCON0          EQU  H'041E'
CRCCON1          EQU  H'041F'

;-----Bank9------------------
SMT1TMR          EQU  H'048C'
SMT1TMRL         EQU  H'048C'
SMT1TMRH         EQU  H'048D'
SMT1TMRU         EQU  H'048E'
SMT1CPR          EQU  H'048F'
SMT1CPRL         EQU  H'048F'
SMT1CPRH         EQU  H'0490'
SMT1CPRU         EQU  H'0491'
SMT1CPW          EQU  H'0492'
SMT1CPWL         EQU  H'0492'
SMT1CPWH         EQU  H'0493'
SMT1CPWU         EQU  H'0494'
SMT1PR           EQU  H'0495'
SMT1PRL          EQU  H'0495'
SMT1PRH          EQU  H'0496'
SMT1PRU          EQU  H'0497'
SMT1CON0         EQU  H'0498'
SMT1CON1         EQU  H'0499'
SMT1STAT         EQU  H'049A'
SMT1CLK          EQU  H'049B'
SMT1SIG          EQU  H'049C'
SMT1WIN          EQU  H'049D'

;-----Bank10------------------
SMT2TMR          EQU  H'050C'
SMT2TMRL         EQU  H'050C'
SMT2TMRH         EQU  H'050D'
SMT2TMRU         EQU  H'050E'
SMT2CPR          EQU  H'050F'
SMT2CPRL         EQU  H'050F'
SMT2CPRH         EQU  H'0510'
SMT2CPRU         EQU  H'0511'
SMT2CPW          EQU  H'0512'
SMT2CPWL         EQU  H'0512'
SMT2CPWH         EQU  H'0513'
SMT2CPWU         EQU  H'0514'
SMT2PR           EQU  H'0515'
SMT2PRL          EQU  H'0515'
SMT2PRH          EQU  H'0516'
SMT2PRU          EQU  H'0517'
SMT2CON0         EQU  H'0518'
SMT2CON1         EQU  H'0519'
SMT2STAT         EQU  H'051A'
SMT2CLK          EQU  H'051B'
SMT2SIG          EQU  H'051C'
SMT2WIN          EQU  H'051D'

;-----Bank11------------------
NCO1ACC          EQU  H'058C'
NCO1ACCL         EQU  H'058C'
NCO1ACCH         EQU  H'058D'
NCO1ACCU         EQU  H'058E'
NCO1INC          EQU  H'058F'
NCO1INCL         EQU  H'058F'
NCO1INCH         EQU  H'0590'
NCO1INCU         EQU  H'0591'
NCO1CON          EQU  H'0592'
NCO1CLK          EQU  H'0593'

;-----Bank12------------------
CWG1CLKCON       EQU  H'060C'
CWG1ISM          EQU  H'060D'
CWG1DBR          EQU  H'060E'
CWG1DBF          EQU  H'060F'
CWG1CON0         EQU  H'0610'
CWG1CON1         EQU  H'0611'
CWG1AS0          EQU  H'0612'
CWG1AS1          EQU  H'0613'
CWG1STR          EQU  H'0614'
CWG2CLKCON       EQU  H'0616'
CWG2ISM          EQU  H'0617'
CWG2DBR          EQU  H'0618'
CWG2DBF          EQU  H'0619'
CWG2CON0         EQU  H'061A'
CWG2CON1         EQU  H'061B'
CWG2AS0          EQU  H'061C'
CWG2AS1          EQU  H'061D'
CWG2STR          EQU  H'061E'

;-----Bank13------------------
CWG3CLKCON       EQU  H'068C'
CWG3ISM          EQU  H'068D'
CWG3DBR          EQU  H'068E'
CWG3DBF          EQU  H'068F'
CWG3CON0         EQU  H'0690'
CWG3CON1         EQU  H'0691'
CWG3AS0          EQU  H'0692'
CWG3AS1          EQU  H'0693'
CWG3STR          EQU  H'0694'

;-----Bank14------------------
PIR0             EQU  H'070C'
PIR1             EQU  H'070D'
PIR2             EQU  H'070E'
PIR3             EQU  H'070F'
PIR4             EQU  H'0710'
PIR5             EQU  H'0711'
PIR6             EQU  H'0712'
PIR7             EQU  H'0713'
PIR8             EQU  H'0714'
PIE0             EQU  H'0716'
PIE1             EQU  H'0717'
PIE2             EQU  H'0718'
PIE3             EQU  H'0719'
PIE4             EQU  H'071A'
PIE5             EQU  H'071B'
PIE6             EQU  H'071C'
PIE7             EQU  H'071D'
PIE8             EQU  H'071E'

;-----Bank15------------------
PMD0             EQU  H'0796'
PMD1             EQU  H'0797'
PMD2             EQU  H'0798'
PMD3             EQU  H'0799'
PMD4             EQU  H'079A'
PMD5             EQU  H'079B'

;-----Bank16------------------
WDTCON0          EQU  H'080C'
WDTCON1          EQU  H'080D'
WDTPSL           EQU  H'080E'
WDTPSH           EQU  H'080F'
WDTTMR           EQU  H'0810'
BORCON           EQU  H'0811'
PCON0            EQU  H'0813'
CCDCON           EQU  H'0814'
NVMADRL          EQU  H'081A'
NVMADRH          EQU  H'081B'
NVMDATL          EQU  H'081C'
NVMDATH          EQU  H'081D'
NVMCON1          EQU  H'081E'
NVMCON2          EQU  H'081F'

;-----Bank17------------------
CPUDOZE          EQU  H'088C'
OSCCON1          EQU  H'088D'
OSCCON2          EQU  H'088E'
OSCCON3          EQU  H'088F'
OSCSTAT          EQU  H'0890'
OSCEN            EQU  H'0891'
OSCTUNE          EQU  H'0892'
OSCFRQ           EQU  H'0893'
CLKRCON          EQU  H'0895'
CLKRCLK          EQU  H'0896'
MDCON0           EQU  H'0897'
MDCON1           EQU  H'0898'
MDSRC            EQU  H'0899'
MDCARL           EQU  H'089A'
MDCARH           EQU  H'089B'

;-----Bank18------------------
FVRCON           EQU  H'090C'
DAC1CON0         EQU  H'090E'
DAC1CON1         EQU  H'090F'
ZCDCON           EQU  H'091F'

;-----Bank19------------------
CMOUT            EQU  H'098F'
CMSTAT           EQU  H'098F'
CM1CON0          EQU  H'0990'
CM1CON1          EQU  H'0991'
CM1NSEL          EQU  H'0992'
CM1PSEL          EQU  H'0993'
CM2CON0          EQU  H'0994'
CM2CON1          EQU  H'0995'
CM2NSEL          EQU  H'0996'
CM2PSEL          EQU  H'0997'

;-----Bank28------------------
CLCDATA          EQU  H'0E0F'
CLC1CON          EQU  H'0E10'
CLC1POL          EQU  H'0E11'
CLC1SEL0         EQU  H'0E12'
CLC1SEL1         EQU  H'0E13'
CLC1SEL2         EQU  H'0E14'
CLC1SEL3         EQU  H'0E15'
CLC1GLS0         EQU  H'0E16'
CLC1GLS1         EQU  H'0E17'
CLC1GLS2         EQU  H'0E18'
CLC1GLS3         EQU  H'0E19'
CLC2CON          EQU  H'0E1A'
CLC2POL          EQU  H'0E1B'
CLC2SEL0         EQU  H'0E1C'
CLC2SEL1         EQU  H'0E1D'
CLC2SEL2         EQU  H'0E1E'
CLC2SEL3         EQU  H'0E1F'
CLC2GLS0         EQU  H'0E20'
CLC2GLS1         EQU  H'0E21'
CLC2GLS2         EQU  H'0E22'
CLC2GLS3         EQU  H'0E23'
CLC3CON          EQU  H'0E24'
CLC3POL          EQU  H'0E25'
CLC3SEL0         EQU  H'0E26'
CLC3SEL1         EQU  H'0E27'
CLC3SEL2         EQU  H'0E28'
CLC3SEL3         EQU  H'0E29'
CLC3GLS0         EQU  H'0E2A'
CLC3GLS1         EQU  H'0E2B'
CLC3GLS2         EQU  H'0E2C'
CLC3GLS3         EQU  H'0E2D'
CLC4CON          EQU  H'0E2E'
CLC4POL          EQU  H'0E2F'
CLC4SEL0         EQU  H'0E30'
CLC4SEL1         EQU  H'0E31'
CLC4SEL2         EQU  H'0E32'
CLC4SEL3         EQU  H'0E33'
CLC4GLS0         EQU  H'0E34'
CLC4GLS1         EQU  H'0E35'
CLC4GLS2         EQU  H'0E36'
CLC4GLS3         EQU  H'0E37'

;-----Bank29------------------
PPSLOCK          EQU  H'0E8F'
INTPPS           EQU  H'0E90'
T0CKIPPS         EQU  H'0E91'
T1CKIPPS         EQU  H'0E92'
T1GPPS           EQU  H'0E93'
T3CKIPPS         EQU  H'0E94'
T3GPPS           EQU  H'0E95'
T5CKIPPS         EQU  H'0E96'
T5GPPS           EQU  H'0E97'
T2AINPPS         EQU  H'0E9C'
T4AINPPS         EQU  H'0E9D'
T6AINPPS         EQU  H'0E9E'
CCP1PPS          EQU  H'0EA1'
CCP2PPS          EQU  H'0EA2'
CCP3PPS          EQU  H'0EA3'
CCP4PPS          EQU  H'0EA4'
CCP5PPS          EQU  H'0EA5'
SMT1WINPPS       EQU  H'0EA9'
SMT1SIGPPS       EQU  H'0EAA'
SMT2WINPPS       EQU  H'0EAB'
SMT2SIGPPS       EQU  H'0EAC'
CWG1PPS          EQU  H'0EB1'
CWG2PPS          EQU  H'0EB2'
CWG3PPS          EQU  H'0EB3'
MDCARLPPS        EQU  H'0EB8'
MDCARHPPS        EQU  H'0EB9'
MDSRCPPS         EQU  H'0EBA'
CLCIN0PPS        EQU  H'0EBB'
CLCIN1PPS        EQU  H'0EBC'
CLCIN2PPS        EQU  H'0EBD'
CLCIN3PPS        EQU  H'0EBE'
ADCACTPPS        EQU  H'0EC3'
SSP1CLKPPS       EQU  H'0EC5'
SSP1DATPPS       EQU  H'0EC6'
SSP1SSPPS        EQU  H'0EC7'
SSP2CLKPPS       EQU  H'0EC8'
SSP2DATPPS       EQU  H'0EC9'
SSP2SSPPS        EQU  H'0ECA'
RXPPS            EQU  H'0ECB'
TXPPS            EQU  H'0ECC'

;-----Bank30------------------
RA0PPS           EQU  H'0F10'
RA1PPS           EQU  H'0F11'
RA2PPS           EQU  H'0F12'
RA3PPS           EQU  H'0F13'
RA4PPS           EQU  H'0F14'
RA5PPS           EQU  H'0F15'
RA6PPS           EQU  H'0F16'
RA7PPS           EQU  H'0F17'
RB0PPS           EQU  H'0F18'
RB1PPS           EQU  H'0F19'
RB2PPS           EQU  H'0F1A'
RB3PPS           EQU  H'0F1B'
RB4PPS           EQU  H'0F1C'
RB5PPS           EQU  H'0F1D'
RB6PPS           EQU  H'0F1E'
RB7PPS           EQU  H'0F1F'
RC0PPS           EQU  H'0F20'
RC1PPS           EQU  H'0F21'
RC2PPS           EQU  H'0F22'
RC3PPS           EQU  H'0F23'
RC4PPS           EQU  H'0F24'
RC5PPS           EQU  H'0F25'
RC6PPS           EQU  H'0F26'
RC7PPS           EQU  H'0F27'
RD0PPS           EQU  H'0F28'
RD1PPS           EQU  H'0F29'
RD2PPS           EQU  H'0F2A'
RD3PPS           EQU  H'0F2B'
RD4PPS           EQU  H'0F2C'
RD5PPS           EQU  H'0F2D'
RD6PPS           EQU  H'0F2E'
RD7PPS           EQU  H'0F2F'
RE0PPS           EQU  H'0F30'
RE1PPS           EQU  H'0F31'
RE2PPS           EQU  H'0F32'
ANSELA           EQU  H'0F38'
WPUA             EQU  H'0F39'
ODCONA           EQU  H'0F3A'
SLRCONA          EQU  H'0F3B'
INLVLA           EQU  H'0F3C'
IOCAP            EQU  H'0F3D'
IOCAN            EQU  H'0F3E'
IOCAF            EQU  H'0F3F'
CCDNA            EQU  H'0F40'
CCDPA            EQU  H'0F41'
ANSELB           EQU  H'0F43'
WPUB             EQU  H'0F44'
ODCONB           EQU  H'0F45'
SLRCONB          EQU  H'0F46'
INLVLB           EQU  H'0F47'
IOCBP            EQU  H'0F48'
IOCBN            EQU  H'0F49'
IOCBF            EQU  H'0F4A'
CCDNB            EQU  H'0F4B'
CCDPB            EQU  H'0F4C'
ANSELC           EQU  H'0F4E'
WPUC             EQU  H'0F4F'
ODCONC           EQU  H'0F50'
SLRCONC          EQU  H'0F51'
INLVLC           EQU  H'0F52'
IOCCP            EQU  H'0F53'
IOCCN            EQU  H'0F54'
IOCCF            EQU  H'0F55'
CCDNC            EQU  H'0F56'
CCDPC            EQU  H'0F57'
ANSELD           EQU  H'0F59'
WPUD             EQU  H'0F5A'
ODCOND           EQU  H'0F5B'
SLRCOND          EQU  H'0F5C'
INLVLD           EQU  H'0F5D'
CCDND            EQU  H'0F61'
CCDPD            EQU  H'0F62'
ANSELE           EQU  H'0F64'
WPUE             EQU  H'0F65'
ODCONE           EQU  H'0F66'
SLRCONE          EQU  H'0F67'
INLVLE           EQU  H'0F68'
IOCEP            EQU  H'0F69'
IOCEN            EQU  H'0F6A'
IOCEF            EQU  H'0F6B'
CCDNE            EQU  H'0F6C'
CCDPE            EQU  H'0F6D'

;-----Bank31------------------
STATUS_SHAD      EQU  H'0FE4'
WREG_SHAD        EQU  H'0FE5'
BSR_SHAD         EQU  H'0FE6'
PCLATH_SHAD      EQU  H'0FE7'
FSR0L_SHAD       EQU  H'0FE8'
FSR0H_SHAD       EQU  H'0FE9'
FSR1L_SHAD       EQU  H'0FEA'
FSR1H_SHAD       EQU  H'0FEB'
STKPTR           EQU  H'0FED'
TOSL             EQU  H'0FEE'
TOSH             EQU  H'0FEF'

;----- STATUS Bits -----------------------------------------------------
C                EQU  H'0000'
DC               EQU  H'0001'
Z                EQU  H'0002'
NOT_PD           EQU  H'0003'
NOT_TO           EQU  H'0004'


;----- BSR Bits -----------------------------------------------------
BSR0             EQU  H'0000'
BSR1             EQU  H'0001'
BSR2             EQU  H'0002'
BSR3             EQU  H'0003'
BSR4             EQU  H'0004'


;----- INTCON Bits -----------------------------------------------------
INTEDG           EQU  H'0000'
PEIE             EQU  H'0006'
GIE              EQU  H'0007'


